# 从任务列表界面逐个进行操作

# 1 进入我的任务界面
# 2 根据任务名称和工作对象简称 搜索后确定唯一的一个任务进行操作
# 2.1 选中目标记录，点击：工作对象菜单->设计数据视图(hover)->创建数据视图组件
# 2.2 选中目标记录，点击：工作对象菜单->设计数据视图(hover)->创建数据视图组件->(弹窗)点击：确认
# 2.3 选中目标记录，点击：工作对象菜单->设计数据视图(hover)->设计数据视图组件
# 在 设计数据视图组件 界面中
# 3 点击树的第一条记录
# 4 填入 基础开发方案 和 基础组件 等参数
# 5 点击右下角 修改
# 6 右键点击树的第一条记录  然后->设计对象组件(hover)->从基础对象创建本对象-复制数据字典并创建界面
# 7 三次确定

# 创建IT组件
# 点击：创建的操作界面->[界面名称]->使用界面的IT组件(右键)->新增
# 依次选择 型号、IT组件别名、IT组件  -> 点击：增加
# 关闭操作结果界面和创建IT组件界面
# 发布
# [IT组件别名 同名]右键->创建使用的界面(hover)->创建并发布-向{publish.json->dest_env}
# 三次确定

